const products = [
    {
        id: "SQ-TST-001",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 860,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Титан софттач",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "titan_softtouch.png"
    },
    {
        id: "SQ-SRU-002",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 640,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "сірий ум",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "siryi_um.png"
    },
    {
        id: "SQ-DAN-003",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб антік",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "dub_antik.png"
    },
    {
        id: "SQ-DVT-004",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб Вотан",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "dub_votan.png"
    },
    {
        id: "SQ-KSH-005",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Кашемір",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "kashemir.png"
    },
    {
        id: "SQ-DKM-006",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб кам'яний",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "dub_kamyanyy.png"
    },
    {
        id: "SQ-FPL-007",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Фанера палена",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "fanera_palena.png"
    },
    {
        id: "SQ-BUM-008",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 640,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Білий ультрамат",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "bilyy_ultramat.png"
    },
    {
        id: "SQ-DBL-009",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб болтон",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "dub_bolton.png"
    },
    {
        id: "SQ-RBL-010",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 670,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Рустік блан",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "rustik_blan.png"
    },
    {
        id: "SQ-RZT-011",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 730,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Рустік золотий",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "rustik_zolotyy.png"
    },
    {
        id: "SQ-RAV-012",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 670,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Рустік авіньон",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "rustik_avignon.png"
    },
    {
        id: "SQ-YKP-013",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Ялина карпатська",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Квадрат",
        image: "yalyna_karpatska.png"
    },
    {
        id: "ST-TST-001",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1580,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Титан софттач",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "titan_softtouch.png"
    },
    {
        id: "ST-SRU-002",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1140,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "сірий ум",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "siryi_um.png"
    },
    {
        id: "ST-DAN-003",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб антік",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "dub_antik.png"
    },
    {
        id: "ST-DVT-004",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб Вотан",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "dub_votan.png"
    },
    {
        id: "ST-KSH-005",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Кашемір",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "kashemir.png"
    },
    {
        id: "ST-DKM-006",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб кам'яний",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "dub_kamyanyy.png"
    },
    {
        id: "ST-FPL-007",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Фанера палена",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "fanera_palena.png"
    },
    {
        id: "ST-BUM-008",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1140,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Білий ультрамат",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "bilyy_ultramat.png"
    },
    {
        id: "ST-DBL-009",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб болтон",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "dub_bolton.png"
    },
    {
        id: "ST-RBL-010",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1190,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Рустік блан",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "rustik_blan.png"
    },
    {
        id: "ST-RZT-011",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1330,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Рустік золотий",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "rustik_zolotyy.png"
    },
    {
        id: "ST-RAV-012",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1190,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Рустік авіньон",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "rustik_avignon.png"
    },
    {
        id: "ST-YKP-013",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Ялина карпатська",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Смуги",
        image: "yalyna_karpatska.png"
    },
    {
        id: "MDF-TST-001",
        name: "СТІНОВА МДФ ПАНЕЛЬ - комплект",
        price: 1111,
        description: "<p>Готове рішення для стильних стін (старт + панель + фініш)</p><p><strong>Комплект:</strong></p><ul><li>Панель — 555 грн</li><li>Старт — 278 грн</li><li>Фініш — 278 грн</li></ul><p><strong>Конструктив:</strong> МДФ, вкритий плівкою ПВХ або ППЛ.</p><p><strong>Упаковка:</strong> Стандартна упаковка: стінова панель 5 шт. по 2780 мм довжиною, стартова планка 10 шт. по 2780 мм довжиною, фінішна планка 10 шт. по 27800 мм довжиною. Окутані в стрейч-плівку, торці захищені картоном, зафіксовані скотчем. Мінімальний комплект 1 шт.</p><p>Колір плівки - вказаний в прайсі.</p>",
        color: "Дуб Болтон, Сканді, Елегансія Меджик, дуб Вотан, дуб Антік, Білий Ультрамат (УМ), Сірий УМ, Чорний УМ",
        size: "117 х 2780 х 12 мм",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Стінові панелі",
        image: "MDF-TST-001.jpg"
    },
    {
        id: "HEX-TST-001",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "ДУБ СОНОМА",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Соти",
        image: "dub_sonoma.png"
    },
    {
        id: "HEX-SRU-002",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "КЛЕН",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Соти",
        image: "klen.png"
    },
    {
        id: "HEX-DAN-003",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "ДУБ КРАФТ ЗОЛОТИЙ",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Соти",
        image: "dub_kraft_zolotyy.jpg"
    },
    {
        id: "HEX-DVT-004",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "БЕЖ",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Соти",
        image: "bezh.png"
    },
    {
        id: "HEX-KSH-005",
        name: "КОМПЛЕКТ СТАРТ-ФІНІШ",
        price: 155,
        description: "КОМПЛЕКТ СТАРТ-ФІНІШ",
        color: "ВСІ КОЛЬОРИ З АСОРТИМЕНТУ",
        size: "",
        coating: "ПВХ",
        category: "Акустичні панелі",
        subcategory: "Комплектуючі",
        image: "start-finish.jpg"
    },
    {
        id: "DR-0001",
        name: "Двері міжкімнатні Меленія-1",
        price: 5228,
        description: "Двері міжкімнатні Меленія-1 - стильні та сучасні двері для вашого інтер'єру",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0001/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0001-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5228,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0001/Білий.jpg", "DR-0001/Бартекс грей.jpg", "DR-0001/Дуб болтон.jpg", "DR-0001/Елегансія Магік.jpg", "DR-0001/Рустік Авіньон.jpg", "DR-0001/Сканді.jpg"]
            },
            {
                id: "DR-0001-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5541,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0001/Білий.jpg", "DR-0001/Бартекс грей.jpg", "DR-0001/Дуб болтон.jpg", "DR-0001/Елегансія Магік.jpg", "DR-0001/Рустік Авіньон.jpg", "DR-0001/Сканді.jpg"]
            },
            {
                id: "DR-0001-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4928,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0001/Білий УМ.jpg", "DR-0001/Дуб грей.jpg", "DR-0001/Дуб крем.jpg", "DR-0001/Дуб шато.jpg"]
            },
            {
                id: "DR-0001-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5270,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0001/Білий УМ.jpg", "DR-0001/Дуб грей.jpg", "DR-0001/Дуб крем.jpg", "DR-0001/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "DR-0002",
        name: "Двері міжкімнатні Меленія-2",
        price: 5270,
        description: "Двері міжкімнатні Меленія-2 - стильні та сучасні двері для вашого інтер'єру",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0002/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0002-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5270,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0002/Білий.jpg", "DR-0002/Бартекс грей.jpg", "DR-0002/Дуб болтон.jpg", "DR-0002/Елегансія Магік.jpg", "DR-0002/Рустік Авіньон.jpg", "DR-0002/Сканді.jpg"]
            },
            {
                id: "DR-0002-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5480,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0002/Білий.jpg", "DR-0002/Бартекс грей.jpg", "DR-0002/Дуб болтон.jpg", "DR-0002/Елегансія Магік.jpg", "DR-0002/Рустік Авіньон.jpg", "DR-0002/Сканді.jpg"]
            },
            {
                id: "DR-0002-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4880,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0002/Білий УМ.jpg", "DR-0002/Дуб грей.jpg", "DR-0002/Дуб крем.jpg", "DR-0002/Дуб шато.jpg"]
            },
            {
                id: "DR-0002-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5051,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0002/Білий УМ.jpg", "DR-0002/Дуб грей.jpg", "DR-0002/Дуб крем.jpg", "DR-0002/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "DR-0003",
        name: "Двері міжкімнатні Меленія-3",
        price: 5292,
        description: "Двері міжкімнатні Меленія-3 - стильні та сучасні двері для вашого інтер'єру",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0003/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0003-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5292,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0003/Білий.jpg", "DR-0003/Бартекс грей.jpg", "DR-0003/Дуб болтон.jpg", "DR-0003/Елегансія Магік.jpg", "DR-0003/Рустік Авіньон.jpg", "DR-0003/Сканді.jpg"]
            },
            {
                id: "DR-0003-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5510,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0003/Білий.jpg", "DR-0003/Бартекс грей.jpg", "DR-0003/Дуб болтон.jpg", "DR-0003/Елегансія Магік.jpg", "DR-0003/Рустік Авіньон.jpg", "DR-0003/Сканді.jpg"]
            },
            {
                id: "DR-0003-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4911,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0003/Білий УМ.jpg", "DR-0003/Дуб грей.jpg", "DR-0003/Дуб крем.jpg", "DR-0003/Дуб шато.jpg"]
            },
            {
                id: "DR-0003-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5093,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0003/Білий УМ.jpg", "DR-0003/Дуб грей.jpg", "DR-0003/Дуб крем.jpg", "DR-0003/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "DR-0004",
        name: "Двері міжкімнатні Меленія-4",
        price: 5558,
        description: "Двері міжкімнатні Меленія-4 - стильні та сучасні двері для вашого інтер'єру",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0004/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0004-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5558,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0004/Білий.jpg", "DR-0004/Бартекс грей.jpg", "DR-0004/Дуб болтон.jpg", "DR-0004/Елегансія Магік.jpg", "DR-0004/Рустік Авіньон.jpg", "DR-0004/Сканді.jpg"]
            },
            {
                id: "DR-0004-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 6065,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0004/Білий.jpg", "DR-0004/Бартекс грей.jpg", "DR-0004/Дуб болтон.jpg", "DR-0004/Елегансія Магік.jpg", "DR-0004/Рустік Авіньон.jpg", "DR-0004/Сканді.jpg"]
            },
            {
                id: "DR-0004-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 5015,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0004/Білий УМ.jpg", "DR-0004/Дуб грей.jpg", "DR-0004/Дуб крем.jpg", "DR-0004/Дуб шато.jpg"]
            },
            {
                id: "DR-0004-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5435,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0004/Білий УМ.jpg", "DR-0004/Дуб грей.jpg", "DR-0004/Дуб крем.jpg", "DR-0004/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "DR-0005",
        name: "Двері міжкімнатні Меленія-5",
        price: 5241,
        description: "Двері міжкімнатні Меленія-5 - стильні та сучасні двері для вашого інтер'єру",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0005/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0005-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5241,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0005/Білий.jpg", "DR-0005/Бартекс грей.jpg", "DR-0005/Дуб болтон.jpg", "DR-0005/Елегансія Магік.jpg", "DR-0005/Рустік Авіньон.jpg", "DR-0005/Сканді.jpg"]
            },
            {
                id: "DR-0005-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5483,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0005/Білий.jpg", "DR-0005/Бартекс грей.jpg", "DR-0005/Дуб болтон.jpg", "DR-0005/Елегансія Магік.jpg", "DR-0005/Рустік Авіньон.jpg", "DR-0005/Сканді.jpg"]
            },
            {
                id: "DR-0005-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4617,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0005/Білий УМ.jpg", "DR-0005/Дуб грей.jpg", "DR-0005/Дуб крем.jpg", "DR-0005/Дуб шато.jpg"]
            },
            {
                id: "DR-0005-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 4956,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0005/Білий УМ.jpg", "DR-0005/Дуб грей.jpg", "DR-0005/Дуб крем.jpg", "DR-0005/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "DR-0006",
        name: "Двері міжкімнатні Меленія-6",
        price: 5286,
        description: "Двері міжкімнатні Меленія-6 - стильні та сучасні двері для вашого інтер'єру",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0006/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0006-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5286,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0006/Білий.jpg", "DR-0006/Бартекс грей.jpg", "DR-0006/Дуб болтон.jpg", "DR-0006/Елегансія Магік.jpg", "DR-0006/Рустік Авіньон.jpg", "DR-0006/Сканді.jpg"]
            },
            {
                id: "DR-0006-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5549,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0006/Білий.jpg", "DR-0006/Бартекс грей.jpg", "DR-0006/Дуб болтон.jpg", "DR-0006/Елегансія Магік.jpg", "DR-0006/Рустік Авіньон.jpg", "DR-0006/Сканді.jpg"]
            },
            {
                id: "DR-0006-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4893,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0006/Білий УМ.jpg", "DR-0006/Дуб грей.jpg", "DR-0006/Дуб крем.jpg", "DR-0006/Дуб шато.jpg"]
            },
            {
                id: "DR-0006-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5451,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0006/Білий УМ.jpg", "DR-0006/Дуб грей.jpg", "DR-0006/Дуб крем.jpg", "DR-0006/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "DR-0008",
        name: "Двері міжкімнатні Меленія-8",
        price: 5156,
        description: "Модель MN 08— елегантна модель з колекції Меланія, яка поєднує сучасний дизайн із витонченими декоративними акцентами. Конструкція полотна виготовлена за збірною технологією, що гарантує високу точність стиків, стабільність та надійність у щоденному користуванні.Гармонійне поєднання декоративних елементів зі скляними вставками додають полотну візуальної легкості та створюють відчуття простору. Такий дизайн робить двері універсальними — вони вдало поєднуються як із сучасними мінімалістичними інтер'єрами, так і з класичними стилями оформлення.",
        color: "Білий супермат, Дуб болтон, Дуб стоун, Титан софттач, Горіх італійський, Білий УМ, Дуб ольс",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0008/Білий супермат.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0008-1",
                coating: "ППЛ",
                glass: "без скла",
                price: 5156,
                colors: ["Білий супермат", "Дуб болтон", "Дуб стоун", "Титан софттач"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0008/Білий супермат.jpg", "DR-0008/Дуб болтон.jpg", "DR-0008/Дуб стоун.jpg", "DR-0008/Титан софттач.jpg"]
            },
            {
                id: "DR-0008-2",
                coating: "ПВХ",
                glass: "без скла",
                price: 4634,
                colors: ["Горіх італійський", "Білий УМ", "Дуб ольс"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0008/Горіх італійський.jpg", "DR-0008/Білий УМ.jpg", "DR-0008/Дуб ольс.jpg"]
            },
            {
                id: "DR-0008-3",
                coating: "ППЛ",
                glass: "дзеркало",
                price: 6404,
                colors: ["Титан софттач"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0008 glasses/Титан софттач.jpg"]
            },
            {
                id: "DR-0008-4",
                coating: "ППЛ",
                glass: "графіт",
                price: 8309,
                colors: ["Титан софттач"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0008 glasses/Титан софттач.jpg"]
            },
            {
                id: "DR-0008-5",
                coating: "ПВХ",
                glass: "дзеркало",
                price: 6143,
                colors: ["Титан софттач"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0008 glasses/Титан софттач.jpg"]
            },
            {
                id: "DR-0008-6",
                coating: "ПВХ",
                glass: "графіт",
                price: 8076,
                colors: ["Титан софттач"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0008 glasses/Титан софттач.jpg"]
            }
        ]
    },
    {
        id: "DR-0009",
        name: "Двері міжкімнатні Меленія класік",
        price: 6342,
        description: "Модель Класік New Завдяки гармонійному поєднанню декоративних елементів та скляних вставок, двері підходять як для сучасних, так і для класичних інтер'єрів.Модель виготовляється у ПВХ та ППЛ-покритті, а також доступна у варіанті фарбування за палітрою RAL, що дозволяє підібрати індивідуальний відтінок під будь-який інтер'єр.",
        color: "Білий ультрамат",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "DR-0009/Білий Ультрамат.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0009-1",
                coating: "ППЛ",
                glass: "глухе",
                price: 6342,
                colors: ["Білий ультрамат"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0009/Білий Ультрамат.jpg"]
            },
            {
                id: "DR-0009-2",
                coating: "ППЛ",
                glass: "сатин",
                price: 7416,
                colors: ["Білий ультрамат"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0009/Білий ультрамат скло.jpg"]
            },
            {
                id: "DR-0009-3",
                coating: "ПВХ",
                glass: "глухе",
                price: 5708,
                colors: ["Білий ультрамат"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0009/Білий Ультрамат.jpg"]
            },
            {
                id: "DR-0009-4",
                coating: "ПВХ",
                glass: "сатин",
                price: 7094,
                colors: ["Білий ультрамат"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0009/Білий ультрамат скло.jpg"]
            }
        ]
    },
    {
        id: "DR-0010",
        name: "Двері міжкімнатні Меленія Стокгольм",
        price: 5849,
        description: "Модель Стокгольм— елегантна класична модель колекції Меланія, яка поєднує сучасний дизайн з витонченими деталями. Конструкція полотна виготовлена за збірною технологією, що забезпечує точність стиків і надійну експлуатацію.Завдяки гармонійному поєднанню декоративних елементів та скляних вставок, двері підходять як для сучасних, так і для класичних інтер'єрів.Модель може бути представлена у покриттях ПВХ та ППЛ, які забезпечують довговічність, стійкість до пошкоджень та легкість у догляді. А також пофарбована за палітрою RAL.",
        color: "Білий ультрамат, Колір під фарбу",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ, Фарба",
        category: "Двері",
        image: "DR-0010/Білий ультрамат.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "DR-0010-1",
                coating: "ППЛ",
                glass: "глухе",
                price: 5849,
                colors: ["Білий ультрамат"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0010/Білий ультрамат.jpg"]
            },
            {
                id: "DR-0010-2",
                coating: "ПВХ",
                glass: "глухе",
                price: 5276,
                colors: ["Білий ультрамат"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0010/Білий ультрамат.jpg"]
            },
            {
                id: "DR-0010-3",
                coating: "Фарба",
                glass: "глухе",
                price: 10853,
                colors: ["Колір під фарбу"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["DR-0010/Колір під фарбу.jpg"]
            }
        ]
    },
    {
        id: "RV-0001",
        name: "Двері міжкімнатні Рів'єра 1",
        price: 5273,
        description: "Модель RV 01 — сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий, Бартекс грей, Дуб болтон, Ясень, Елегансія Магік, Рустік Авіньон, Сканді, Рустік блан, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0001/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0001-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5273,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Ясень", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0001/Білий.jpg", "RV-0001/Бартекс грей.jpg", "RV-0001/Дуб болтон.jpg", "RV-0001/Ясень.jpg", "RV-0001/Елегансія Магік.jpg", "RV-0001/Рустік Авіньон.jpg", "RV-0001/сканді.jpg", "RV-0001/Рустік блан.jpg"]
            },
            {
                id: "RV-0001-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5474,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Ясень", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0001/Білий.jpg", "RV-0001/Бартекс грей.jpg", "RV-0001/Дуб болтон.jpg", "RV-0001/Ясень.jpg", "RV-0001/Елегансія Магік.jpg", "RV-0001/Рустік Авіньон.jpg", "RV-0001/сканді.jpg", "RV-0001/Рустік блан.jpg"]
            },
            {
                id: "RV-0001-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4820,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0001/Білий УМ.jpg", "RV-0001/Дуб грей.jpg", "RV-0001/Дуб крем.jpg", "RV-0001/Дуб шато.jpg"]
            },
            {
                id: "RV-0001-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5022,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0001/Білий УМ.jpg", "RV-0001/Дуб грей.jpg", "RV-0001/Дуб крем.jpg", "RV-0001/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "RV-0002",
        name: "Двері міжкімнатні Рів'єра 2",
        price: 5273,
        description: "Модель RV 02— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Рустік блан, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0002/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0002-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5273,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0002/Білий.jpg", "RV-0002/Бартекс грей.jpg", "RV-0002/Дуб болтон.jpg", "RV-0002/Елегансія Магік.jpg", "RV-0002/Рустік Авіньон.jpg", "RV-0002/сканді.jpg", "RV-0002/Рустік блан.jpg"]
            },
            {
                id: "RV-0002-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5474,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0002/Білий.jpg", "RV-0002/Бартекс грей.jpg", "RV-0002/Дуб болтон.jpg", "RV-0002/Елегансія Магік.jpg", "RV-0002/Рустік Авіньон.jpg", "RV-0002/сканді.jpg", "RV-0002/Рустік блан.jpg"]
            },
            {
                id: "RV-0002-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4820,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0002/Білий УМ.jpg", "RV-0002/Дуб грей.jpg", "RV-0002/Дуб крем.jpg", "RV-0002/Дуб шато.jpg"]
            },
            {
                id: "RV-0002-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5022,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0002/Білий УМ.jpg", "RV-0002/Дуб грей.jpg", "RV-0002/Дуб крем.jpg", "RV-0002/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "RV-0003",
        name: "Двері міжкімнатні Рів'єра 3",
        price: 5273,
        description: "Модель RV 03— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, Сканді, Рустік блан, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0003/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0003-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5273,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0003/Білий.jpg", "RV-0003/Бартекс грей.jpg", "RV-0003/Дуб болтон.jpg", "RV-0003/Елегансія Магік.jpg", "RV-0003/Рустік Авіньон.jpg", "RV-0003/сканді.jpg", "RV-0003/Рустік блан.jpg"]
            },
            {
                id: "RV-0003-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5474,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0003/Білий.jpg", "RV-0003/Бартекс грей.jpg", "RV-0003/Дуб болтон.jpg", "RV-0003/Елегансія Магік.jpg", "RV-0003/Рустік Авіньон.jpg", "RV-0003/сканді.jpg", "RV-0003/Рустік блан.jpg"]
            },
            {
                id: "RV-0003-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4820,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0003/Білий УМ.jpg", "RV-0003/Дуб грей.jpg", "RV-0003/Дуб крем.jpg", "RV-0003/Дуб шато.jpg"]
            },
            {
                id: "RV-0003-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5022,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0003/Білий УМ.jpg", "RV-0003/Дуб грей.jpg", "RV-0003/Дуб крем.jpg", "RV-0003/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "RV-0004",
        name: "Двері міжкімнатні Рів'єра 4",
        price: 5414,
        description: "Модель RV 04— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Титан софтач, Білий, Сірий ум",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0004/Титан софтач.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0004-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5414,
                colors: ["Титан софтач", "Білий"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0004/Титан софтач.jpg", "RV-0004/Білий.jpg"]
            },
            {
                id: "RV-0004-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5621,
                colors: ["білий чорне", "титан софттач чорне"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0004/білий чорне.jpg", "RV-0004/титан софттач чорне.jpg"]
            },
            {
                id: "RV-0004-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4949,
                colors: ["Білий", "Сірий ум"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0004/Білий.jpg", "RV-0004/Сірий ум.jpg"]
            },
            {
                id: "RV-0004-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5156,
                colors: ["Сірий ум", "білий чорне"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0004/Сірий ум.jpg", "RV-0004/білий чорне.jpg"]
            }
        ]
    },
    {
        id: "RV-0005",
        name: "Двері міжкімнатні Рів'єра 5",
        price: 5414,
        description: "Модель RV 05— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Титан софтач, Білий, Білий УМ",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0005/Титан софттач.png",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0005-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5414,
                colors: ["Титан софттач", "Білий"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0005/Титан софттач.png", "RV-0005/Білий.jpg"]
            },
            {
                id: "RV-0005-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5621,
                colors: ["Титан софттач", "Білий"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0005/Титан софттач (2).jpg", "RV-0005/Білий (2).jpg"]
            },
            {
                id: "RV-0005-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4949,
                colors: ["Білий УМ"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0005/Білий УМ.jpg"]
            },
            {
                id: "RV-0005-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5156,
                colors: ["Білий УМ"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0005/Білий УМ.jpg"]
            }
        ]
    },
    {
        id: "RV-0006",
        name: "Двері міжкімнатні Рів'єра 6",
        price: 5273,
        description: "Модель RV 06— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий сатин, Титан софттач сатин, Титан софттач чорне, Білий чорне",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ",
        category: "Двері",
        image: "RV-0006/Білий сатин.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0006-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5273,
                colors: ["Білий сатин", "Титан софттач сатин"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0006/Білий сатин.jpg", "RV-0006/Титан софттач сатин.jpg"]
            },
            {
                id: "RV-0006-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5474,
                colors: ["Титан софттач чорне", "Білий чорне"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0006/Титан софттач чорне.jpg", "RV-0006/Білий чорне.jpg"]
            }
        ]
    },
    {
        id: "RV-0007",
        name: "Двері міжкімнатні Рів'єра 7",
        price: 5742,
        description: "Модель RV 07— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Дуб болтон, сканді",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ",
        category: "Двері",
        image: "RV-0007/Дуб болтон.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0007-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5742,
                colors: ["Дуб болтон", "сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0007/Дуб болтон.jpg", "RV-0007/сканді.jpg"]
            },
            {
                id: "RV-0007-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5963,
                colors: ["Дуб болтон", "сканді"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0007/Дуб болтон.jpg", "RV-0007/сканді.jpg"]
            }
        ]
    },
    {
        id: "RV-0008",
        name: "Двері міжкімнатні Рів'єра 8",
        price: 5366,
        description: "Модель RV 08— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, сканді, Рустік блан, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0008/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0008-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5366,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0008/Білий.jpg", "RV-0008/Бартекс грей.jpg", "RV-0008/Дуб болтон.jpg", "RV-0008/Елегансія Магік.jpg", "RV-0008/Рустік Авіньон.jpg", "RV-0008/Сканді.jpg", "RV-0008/Рустік блан.jpg"]
            },
            {
                id: "RV-0008-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5571,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "Сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0008/Білий.jpg", "RV-0008/Бартекс грей.jpg", "RV-0008/Дуб болтон.jpg", "RV-0008/Елегансія Магік.jpg", "RV-0008/Рустік Авіньон.jpg", "RV-0008/Сканді.jpg", "RV-0008/Рустік блан.jpg"]
            },
            {
                id: "RV-0008-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4907,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0008/Білий УМ.jpg", "RV-0008/Дуб грей.jpg", "RV-0008/Дуб крем.jpg", "RV-0008/Дуб шато.jpg"]
            },
            {
                id: "RV-0008-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 5111,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0008/Білий УМ.jpg", "RV-0008/Дуб грей.jpg", "RV-0008/Дуб крем.jpg", "RV-0008/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "RV-0009",
        name: "Двері міжкімнатні Рів'єра 9",
        price: 5225,
        description: "Модель RV 09— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий, Бартекс грей, Дуб болтон, Елегансія Магік, Рустік Авіньон, сканді, Рустік блан, Білий УМ, Дуб грей, Дуб крем, Дуб шато",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-0009/Білий.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-0009-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5225,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0009/Білий.jpg", "RV-0009/Бартекс грей.jpg", "RV-0009/Дуб болтон.jpg", "RV-0009/Елегансія Магік.jpg", "RV-0009/Рустік Авіньон.jpg", "RV-0009/сканди.jpg", "RV-0009/Рустік блан.jpg"]
            },
            {
                id: "RV-0009-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5424,
                colors: ["Білий", "Бартекс грей", "Дуб болтон", "Елегансія Магік", "Рустік Авіньон", "сканді", "Рустік блан"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0009/Білий.jpg", "RV-0009/Бартекс грей.jpg", "RV-0009/Дуб болтон.jpg", "RV-0009/Елегансія Магік.jpg", "RV-0009/Рустік Авіньон.jpg", "RV-0009/сканди.jpg", "RV-0009/Рустік блан.jpg"]
            },
            {
                id: "RV-0009-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4778,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0009/Білий УМ.jpg", "RV-0009/Дуб грей.jpg", "RV-0009/Дуб крем.jpg", "RV-0009/Дуб шато.jpg"]
            },
            {
                id: "RV-0009-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 4977,
                colors: ["Білий УМ", "Дуб грей", "Дуб крем", "Дуб шато"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-0009/Білий УМ.jpg", "RV-0009/Дуб грей.jpg", "RV-0009/Дуб крем.jpg", "RV-0009/Дуб шато.jpg"]
            }
        ]
    },
    {
        id: "RV-00010",
        name: "Двері міжкімнатні Рів'єра 10",
        price: 5178,
        description: "Модель RV 10— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий сатин, Титан софттач сатин, Титан софттач чорне, Білий чорне, Білий УМ сатин, Білий Ум чорне",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-00010/Білий сатин.jpg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-00010-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 5178,
                colors: ["Білий сатин", "Титан софттач сатин"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00010/Білий сатин.jpg", "RV-00010/Титан софттач сатин.jpg"]
            },
            {
                id: "RV-00010-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 5376,
                colors: ["Титан софттач чорне", "Білий чорне"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00010/Титан софттач чорне.jpg", "RV-00010/Білий чорне.jpg"]
            },
            {
                id: "RV-00010-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4734,
                colors: ["Білий УМ сатин"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00010/Білий УМ сатин.jpg"]
            },
            {
                id: "RV-00010-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 4932,
                colors: ["Білий Ум чорне"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00010/Білий Ум чорне.jpg"]
            }
        ]
    },
    {
        id: "RV-00011",
        name: "Двері міжкімнатні Рів'єра 11",
        price: 4430,
        description: "Модель RV 11— сучасна модель колекції Рів'єра, яка поєднує лаконічний дизайн та практичність. Конструкція полотна виконана за збірною технологією, що гарантує точність стиків та надійну експлуатацію.Усі моделі цієї колекції вирізняються наявністю скляних вставок, які додають інтер'єру світла та візуальної легкості. Завдяки варіантам зі склом різних відтінків двері гармонійно вписуються як у сучасні мінімалістичні простори, так і в більш класичні інтер'єри.Двері колекції Рів'єра виконуються у двох видах покриття — ПВХ та ППЛ, що забезпечують довговічність, зручність у догляді та стійкість до щоденного використання.",
        color: "Білий, Білий УМ",
        size: "600*2000, 700*2000, 800*2000, 900*2000",
        coating: "ППЛ, ПВХ",
        category: "Двері",
        image: "RV-00011/Білий.jpeg",
        hasModifications: true,
        modifications: [
            {
                id: "RV-00011-1",
                coating: "ППЛ",
                glass: "сатин",
                price: 4430,
                colors: ["Білий"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00011/Білий.jpeg"]
            },
            {
                id: "RV-00011-2",
                coating: "ППЛ",
                glass: "чорне",
                price: 4628,
                colors: ["Білий"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00011/Білий.jpeg"]
            },
            {
                id: "RV-00011-3",
                coating: "ПВХ",
                glass: "сатин",
                price: 4002,
                colors: ["Білий УМ"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00011/Білий УМ.jpeg"]
            },
            {
                id: "RV-00011-4",
                coating: "ПВХ",
                glass: "чорне",
                price: 4208,
                colors: ["Білий УМ"],
                sizes: ["600*2000", "700*2000", "800*2000", "900*2000"],
                images: ["RV-00011/Білий УМ.jpeg"]
            }
        ]
    }
];

function getProductsByCategory(category) {
    return products.filter(p => p.category === category);
}

function getProductById(id) {
    return products.find(p => p.id === id);
}

function getAllCategories() {
    return [...new Set(products.map(p => p.category))];
}
