const products = [
    {
        id: "SQ-TST-001",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 860,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Титан софттач",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Титан софттач.png"
    },
    {
        id: "SQ-SRU-002",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 640,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "сірий ум",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "сірий ум.png"
    },
    {
        id: "SQ-DAN-003",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб антік",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Дуб антік.png"
    },
    {
        id: "SQ-DVT-004",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб Вотан",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Дуб Вотан.png"
    },
    {
        id: "SQ-KSH-005",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Кашемір",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Кашемір.png"
    },
    {
        id: "SQ-DKM-006",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб кам'яний",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Дуб кам'яний.png"
    },
    {
        id: "SQ-FPL-007",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Фанера палена",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Фанера палена.png"
    },
    {
        id: "SQ-BUM-008",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 640,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Білий ультрамат",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Білий ультрамат.png"
    },
    {
        id: "SQ-DBL-009",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Дуб болтон",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Дуб болтон.png"
    },
    {
        id: "SQ-RBL-010",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 670,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Рустік блан",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Рустік блан.png"
    },
    {
        id: "SQ-RZT-011",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 730,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Рустік золотий",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Рустік золотий.png"
    },
    {
        id: "SQ-RAV-012",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 670,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Рустік авіньон",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Рустік авіньон.png"
    },
    {
        id: "SQ-YKP-013",
        name: "Акустична стінова панель \"Квадрат\"",
        price: 700,
        description: "Акустична стінова панель \"Квадрат\"",
        color: "Ялина карпатська",
        size: "602 х 602 х 17",
        coating: "ПВХ",
        category: "Квадрат",
        image: "Ялина карпатська.png"
    },
    {
        id: "ST-TST-001",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1580,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Титан софттач",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Титан софттач.png"
    },
    {
        id: "ST-SRU-002",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1140,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "сірий ум",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "сірий ум.png"
    },
    {
        id: "ST-DAN-003",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб антік",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Дуб антік.png"
    },
    {
        id: "ST-DVT-004",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб Вотан",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Дуб Вотан.png"
    },
    {
        id: "ST-KSH-005",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Кашемір",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Кашемір.png"
    },
    {
        id: "ST-DKM-006",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб кам'яний",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Дуб кам'яний.png"
    },
    {
        id: "ST-FPL-007",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Фанера палена",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Фанера палена.png"
    },
    {
        id: "ST-BUM-008",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1140,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Білий ультрамат",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Білий ультрамат.png"
    },
    {
        id: "ST-DBL-009",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Дуб болтон",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Дуб болтон.png"
    },
    {
        id: "ST-RBL-010",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1190,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Рустік блан",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Рустік блан.png"
    },
    {
        id: "ST-RZT-011",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1330,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Рустік золотий",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Рустік золотий.png"
    },
    {
        id: "ST-RAV-012",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1190,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Рустік авіньон",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Рустік авіньон.png"
    },
    {
        id: "ST-YKP-013",
        name: "Акустична стінова панель \"Смуги\"",
        price: 1230,
        description: "Акустична стінова панель \"Смуги\" / *ціни вказані без пакування",
        color: "Ялина карпатська",
        size: "301 х 2780 х 17",
        coating: "ПВХ",
        category: "Смуги",
        image: "Ялина карпатська.png"
    },
    {
        id: "MDF-TST-001",
        name: "СТІНОВА МДФ ПАНЕЛЬ",
        price: 555,
        description: "Конструктив - МДФ, вкритий плівкою ПВХ або ППЛ.\nУпаковка - Стандартна упаковка:- стінова панель 5 шт. по 2780 мм довжиною,- стартова планка 10 шт. по 2780 мм довжиною,- фінішна планка 10 шт. по 27800 мм довжиною.\nОкутані в стрейч-плівку, торці захищені картоном, зафіксовані скотчем. Мінімальний комплект 1 шт.\nКолір плівки - вказаний в прайсі.",
        color: "Дуб Болтон, Сканді, Елегансія Меджик, дуб Вотан, дуб Антік, Білий Ультрамат (УМ), Сірий УМ, Чорний УМ",
        size: "117 х 2780 х 12 мм",
        coating: "ПВХ",
        category: "МДФ панелі",
        image: ""
    },
    {
        id: "MDF-SRU-002",
        name: "СТІНОВА МДФ ПАНЕЛЬ",
        price: 278,
        description: "",
        color: "Дуб Болтон, Сканді, Елегансія Меджик, дуб Вотан, дуб Антік, Білий Ультрамат (УМ), Сірий УМ, Чорний УМ",
        size: "117 х 2780 х 12 мм",
        coating: "ПВХ",
        category: "МДФ панелі",
        image: ""
    },
    {
        id: "MDF-DAN-003",
        name: "СТІНОВА МДФ ПАНЕЛЬ",
        price: 278,
        description: "",
        color: "Дуб Болтон, Сканді, Елегансія Меджик, дуб Вотан, дуб Антік, Білий Ультрамат (УМ), Сірий УМ, Чорний УМ",
        size: "117 х 2780 х 12 мм",
        coating: "ПВХ",
        category: "МДФ панелі",
        image: ""
    },
    {
        id: "HEX-TST-001",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "ДУБ СОНОМА",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Соті",
        image: ""
    },
    {
        id: "HEX-SRU-002",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "КЛЕН",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Соті",
        image: ""
    },
    {
        id: "HEX-DAN-003",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "ДУБ КРАФТ ЗОЛОТИЙ",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Соті",
        image: ""
    },
    {
        id: "HEX-DVT-004",
        name: "СТІНОВА АКУСТИЧНА ПАНЕЛЬ СОТИ",
        price: 728,
        description: "ПАНЕЛЬ",
        color: "БЕЖ",
        size: "537 х 620 х 18 мм",
        coating: "ПВХ",
        category: "Соті",
        image: ""
    },
    {
        id: "HEX-KSH-005",
        name: "КОМПЛЕКТ СТАРТ-ФІНІШ",
        price: 155,
        description: "КОМПЛЕКТ СТАРТ-ФІНІШ",
        color: "ВСІ КОЛЬОРИ З АСОРТИМЕНТУ",
        size: "",
        coating: "ПВХ",
        category: "Комплектуючі",
        image: ""
    }
];

function getProductsByCategory(category) {
    return products.filter(p => p.category === category);
}

function getProductById(id) {
    return products.find(p => p.id === id);
}

function getAllCategories() {
    return [...new Set(products.map(p => p.category))];
}
